dabg3/AVRZig/atdf/ATxmega256A3BU_flat.atdf
        <module name="TC" id="I6090" version="XMEGAAU">
          <instance name="TCC0">
            <register-group address-space="data" offset="0x800" name-in-module="TC0" name="TCC0"/>
            <signals>
              <signal field="TC0A" function="TC0" group="OC0A" pad="PC0"/>
              <signal field="TC0B" function="TC0" group="OC0B" pad="PC1"/>
              <signal field="TC0C" function="TC0" group="OC0C" pad="PC2"/>
              <signal field="TC0D" function="TC0" group="OC0D" pad="PC3"/>
              <signal field="TC0A" function="TC0_ALT" group="OC0A" pad="PC4"/>
              <signal field="TC0B" function="TC0_ALT" group="OC0B" pad="PC5"/>
              <signal field="TC0C" function="TC0_ALT" group="OC0C" pad="PC6"/>
              <signal field="TC0D" function="TC0_ALT" group="OC0D" pad="PC7"/>
            </signals>
          </instance>
          <instance name="TCC1">
            <register-group address-space="data" offset="0x840" name-in-module="TC1" name="TCC1"/>
            <signals>
              <signal function="TC1" group="OC1A" pad="PC4"/>
              <signal function="TC1" group="OC1B" pad="PC5"/>
            </signals>
          </instance>
          <instance name="TCD0">
            <register-group address-space="data" offset="0x900" name-in-module="TC0" name="TCD0"/>
            <signals>
              <signal field="TC0A" function="TC0" group="OC0A" pad="PD0"/>
              <signal field="TC0B" function="TC0" group="OC0B" pad="PD1"/>
              <signal field="TC0C" function="TC0" group="OC0C" pad="PD2"/>
              <signal field="TC0D" function="TC0" group="OC0D" pad="PD3"/>
              <signal field="TC0A" function="TC0_ALT" group="OC0A" pad="PD4"/>
              <signal field="TC0B" function="TC0_ALT" group="OC0B" pad="PD5"/>
              <signal field="TC0C" function="TC0_ALT" group="OC0C" pad="PD6"/>
              <signal field="TC0D" function="TC0_ALT" group="OC0D" pad="PD7"/>
            </signals>
          </instance>
          <instance name="TCD1">
            <register-group address-space="data" offset="0x940" name-in-module="TC1" name="TCD1"/>
            <signals>
              <signal function="TC1" group="OC1A" pad="PD4"/>
              <signal function="TC1" group="OC1B" pad="PD5"/>
            </signals>
          </instance>
          <instance name="TCE0">
            <register-group address-space="data" offset="0xA00" name-in-module="TC0" name="TCE0"/>
            <signals>
              <signal function="TC0" group="OC0A" pad="PE0"/>
              <signal function="TC0" group="OC0B" pad="PE1"/>
              <signal function="TC0" group="OC0C" pad="PE2"/>
              <signal function="TC0" group="OC0D" pad="PE3"/>
            </signals>
          </instance>
          <instance name="TCE1">
            <register-group address-space="data" offset="0xA40" name-in-module="TC1" name="TCE1"/>
            <signals>
              <signal function="TC1" group="OC1A" pad="PE4"/>
              <signal function="TC1" group="OC1B" pad="PE5"/>
            </signals>
          </instance>
          <instance name="TCF0">
            <register-group address-space="data" offset="0xB00" name-in-module="TC0" name="TCF0"/>
            <signals>
              <signal function="TC0" group="OC0A" pad="PF0"/>
              <signal function="TC0" group="OC0B" pad="PF1"/>
              <signal function="TC0" group="OC0C" pad="PF2"/>
              <signal function="TC0" group="OC0D" pad="PF3"/>
            </signals>
          </instance>
        </module>
        <module name="TC2" id="I6090" version="XMEGAAU">
          <instance name="TCC2">
            <register-group address-space="data" offset="0x800" name-in-module="TC2" name="TCC2"/>
            <signals>
              <signal function="TC2" group="LOC2A" pad="PC0"/>
              <signal function="TC2" group="LOC2B" pad="PC1"/>
              <signal function="TC2" group="LOC2C" pad="PC2"/>
              <signal function="TC2" group="LOC2D" pad="PC3"/>
              <signal function="TC2" group="HOC2A" pad="PC4"/>
              <signal function="TC2" group="HOC2B" pad="PC5"/>
              <signal function="TC2" group="HOC2C" pad="PC6"/>
              <signal function="TC2" group="HOC2D" pad="PC7"/>
            </signals>
          </instance>
          <instance name="TCD2">
            <register-group address-space="data" offset="0x900" name-in-module="TC2" name="TCD2"/>
            <signals>
              <signal function="TC2" group="LOC2A" pad="PD0"/>
              <signal function="TC2" group="LOC2B" pad="PD1"/>
              <signal function="TC2" group="LOC2C" pad="PD2"/>
              <signal function="TC2" group="LOC2D" pad="PD3"/>
              <signal function="TC2" group="HOC2A" pad="PD4"/>
              <signal function="TC2" group="HOC2B" pad="PD5"/>
              <signal function="TC2" group="HOC2C" pad="PD6"/>
              <signal function="TC2" group="HOC2D" pad="PD7"/>
            </signals>
          </instance>
          <instance name="TCE2">
            <register-group address-space="data" offset="0xA00" name-in-module="TC2" name="TCE2"/>
          </instance>
          <instance name="TCF2">
            <register-group address-space="data" offset="0xB00" name-in-module="TC2" name="TCF2"/>
          </instance>
        </module>
        <module name="AWEX" id="I6090" version="XMEGAAU">
          <instance name="AWEXC">
            <register-group address-space="data" offset="0x880" name-in-module="AWEX" name="AWEXC"/>
            <signals>
              <signal function="AWEX" group="OC0ALS" pad="PC0"/>
              <signal function="AWEX" group="OC0AHS" pad="PC1"/>
              <signal function="AWEX" group="OC0BLS" pad="PC2"/>
              <signal function="AWEX" group="OC0BHS" pad="PC3"/>
              <signal function="AWEX" group="OC0CLS" pad="PC4"/>
              <signal function="AWEX" group="OC0CHS" pad="PC5"/>
              <signal function="AWEX" group="OC0DLS" pad="PC6"/>
              <signal function="AWEX" group="OC0DHS" pad="PC7"/>
            </signals>
          </instance>
