dabg3/AVRZig/atdf/ATxmega256A3BU_flat.atdf
          </instance>
        </module>
        <module name="LOCKBIT" id="I6570" version="XMEGAAU">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" offset="0x00" name-in-module="NVM_LOCKBITS" name="LOCKBIT"/>
          </instance>
        </module>
        <module name="SIGROW" id="I6570" version="XMEGAAU">
          <instance name="PROD_SIGNATURES">
            <register-group address-space="prod_signatures" offset="0x00" name-in-module="NVM_PROD_SIGNATURES" name="PROD_SIGNATURES"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt-group index="1" module-instance="OSC" name-in-module="OSC"/>
        <interrupt-group index="2" module-instance="PORTC" name-in-module="PORT"/>
        <interrupt-group index="4" module-instance="PORTR" name-in-module="PORT"/>
        <interrupt-group index="6" module-instance="DMA" name-in-module="DMA"/>
        <interrupt-group index="10" module-instance="RTC32" name-in-module="RTC32"/>
        <interrupt-group index="12" module-instance="TWIC" name-in-module="TWI"/>
        <interrupt-group index="14" module-instance="TCC0" name-in-module="TC0"/>
        <interrupt-group index="14" module-instance="TCC2" name-in-module="TC2"/>
        <interrupt-group index="20" module-instance="TCC1" name-in-module="TC1"/>
        <interrupt-group index="24" module-instance="SPIC" name-in-module="SPI"/>
        <interrupt-group index="25" module-instance="USARTC0" name-in-module="USART"/>
        <interrupt-group index="28" module-instance="USARTC1" name-in-module="USART"/>
        <interrupt-group index="31" module-instance="AES" name-in-module="AES"/>
        <interrupt-group index="32" module-instance="NVM" name-in-module="NVM"/>
        <interrupt-group index="34" module-instance="PORTB" name-in-module="PORT"/>
        <interrupt-group index="36" module-instance="ACB" name-in-module="AC"/>
        <interrupt-group index="39" module-instance="ADCB" name-in-module="ADC"/>
        <interrupt-group index="43" module-instance="PORTE" name-in-module="PORT"/>
        <interrupt-group index="45" module-instance="TWIE" name-in-module="TWI"/>
        <interrupt-group index="47" module-instance="TCE0" name-in-module="TC0"/>
        <interrupt-group index="47" module-instance="TCE2" name-in-module="TC2"/>
        <interrupt-group index="53" module-instance="TCE1" name-in-module="TC1"/>
        <interrupt-group index="58" module-instance="USARTE0" name-in-module="USART"/>
        <interrupt-group index="64" module-instance="PORTD" name-in-module="PORT"/>
        <interrupt-group index="66" module-instance="PORTA" name-in-module="PORT"/>
        <interrupt-group index="68" module-instance="ACA" name-in-module="AC"/>
        <interrupt-group index="71" module-instance="ADCA" name-in-module="ADC"/>
        <interrupt-group index="77" module-instance="TCD0" name-in-module="TC0"/>
        <interrupt-group index="77" module-instance="TCD2" name-in-module="TC2"/>
        <interrupt-group index="83" module-instance="TCD1" name-in-module="TC1"/>
        <interrupt-group index="87" module-instance="SPID" name-in-module="SPI"/>
        <interrupt-group index="88" module-instance="USARTD0" name-in-module="USART"/>
        <interrupt-group index="91" module-instance="USARTD1" name-in-module="USART"/>
        <interrupt-group index="104" module-instance="PORTF" name-in-module="PORT"/>
        <interrupt-group index="108" module-instance="TCF0" name-in-module="TC0"/>
        <interrupt-group index="108" module-instance="TCF2" name-in-module="TC2"/>
        <interrupt-group index="119" module-instance="USARTF0" name-in-module="USART"/>
        <interrupt-group index="125" module-instance="USB" name-in-module="USB"/>
      </interrupts>
      <interfaces>
        <interface type="pdi" name="PDI"/>
        <interface type="xmegajtag" name="JTAG"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x0984303F"/>
          <property name="SIGNATURE0" value="0x1E"/>
          <property name="SIGNATURE1" value="0x98"/>
          <property name="SIGNATURE2" value="0x43"/>
        </property-group>
        <property-group name="PDI_INTERFACE">
          <property name="APP_SECTION_OFFSET" value="0x00800000"/>
          <property name="APPTABLE_SECTION_OFFSET" value="0x0083E000"/>
          <property name="BOOT_SECTION_OFFSET" value="0x00840000"/>
          <property name="DATAMEM_OFFSET" value="0x01000000"/>
          <property name="EEPROM_OFFSET" value="0x008C0000"/>
          <property name="USER_SIGNATURES_OFFSET" value="0x008E0400"/>
          <property name="PROD_SIGNATURES_OFFSET" value="0x008E0200"/>
          <property name="FUSE_REGISTERS_OFFSET" value="0x008F0020"/>
          <property name="LOCK_REGISTERS_OFFSET" value="0x008F0027"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="GPIO" id="I6085" caption="General Purpose IO">
      <register-group caption="General Purpose IO Registers" name="GPIO" size="16">
        <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x00" size="1"/>
        <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x01" size="1"/>
        <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x02" size="1"/>
        <register caption="General Purpose IO Register 3" name="GPIOR3" offset="0x03" size="1"/>
        <register caption="General Purpose IO Register 4" name="GPIOR4" offset="0x04" size="1"/>
        <register caption="General Purpose IO Register 5" name="GPIOR5" offset="0x05" size="1"/>
        <register caption="General Purpose IO Register 6" name="GPIOR6" offset="0x06" size="1"/>
        <register caption="General Purpose IO Register 7" name="GPIOR7" offset="0x07" size="1"/>
        <register caption="General Purpose IO Register 8" name="GPIOR8" offset="0x08" size="1"/>
        <register caption="General Purpose IO Register 9" name="GPIOR9" offset="0x09" size="1"/>
        <register caption="General Purpose IO Register 10" name="GPIORA" offset="0x0A" size="1"/>
        <register caption="General Purpose IO Register 11" name="GPIORB" offset="0x0B" size="1"/>
        <register caption="General Purpose IO Register 12" name="GPIORC" offset="0x0C" size="1"/>
