dabg3/AVRZig/atdf/ATxmega256A3BU_flat.atdf
      <interrupt-group name="TWI">
        <interrupt index="0" name="TWIS" caption="TWI Slave Interrupt"/>
        <interrupt index="1" name="TWIM" caption="TWI Master Interrupt"/>
      </interrupt-group>
    </module>
    <module name="USB" id="I3005" version="XMEGAAU" caption="USB">
      <register-group caption="USB Endpoint" name="USB_EP" size="8">
        <register caption="Endpoint Status" name="STATUS" offset="0x00" size="1">
          <bitfield caption="Endpoint Stall Flag" mask="0x80" name="STALLF"/>
          <bitfield caption="CRC Error Flag" mask="0x80" name="CRC"/>
          <bitfield caption="Underflow Enpoint FLag" mask="0x40" name="UNF"/>
          <bitfield caption="Overflow Enpoint Flag for Output Endpoints" mask="0x40" name="OVF"/>
          <bitfield caption="Transaction Complete 0 Flag" mask="0x20" name="TRNCOMPL0"/>
          <bitfield caption="Transaction Complete 1 Flag" mask="0x10" name="TRNCOMPL1"/>
          <bitfield caption="SETUP Transaction Complete Flag" mask="0x10" name="SETUP"/>
          <bitfield caption="Bank Select" mask="0x08" name="BANK"/>
          <bitfield caption="Data Buffer 1 Not Acknowledge" mask="0x04" name="BUSNACK1"/>
          <bitfield caption="Data Buffer 0 Not Acknowledge" mask="0x02" name="BUSNACK0"/>
          <bitfield caption="Data Toggle" mask="0x01" name="TOGGLE"/>
        </register>
        <register caption="Endpoint Control" name="CTRL" offset="0x01" size="1">
          <bitfield caption="Endpoint Type" mask="0xC0" name="TYPE" values="USB_EP_TYPE"/>
          <bitfield caption="Multi Packet Transfer Enable" mask="0x20" name="MULTIPKT"/>
          <bitfield caption="Ping-Pong Enable" mask="0x10" name="PINGPONG"/>
          <bitfield caption="Interrupt Disable" mask="0x08" name="INTDSBL"/>
          <bitfield caption="Data Stall" mask="0x04" name="STALL"/>
          <bitfield caption="Data Buffer Size" mask="0x07" name="BUFSIZE" values="USB_EP_BUFSIZE"/>
        </register>
        <register caption="USB Endpoint Counter" name="CNT" offset="0x02" size="2">
          <bitfield caption="Zero Length Packet" mask="0x8000" name="ZLP"/>
        </register>
        <register caption="Data Pointer" name="DATAPTR" offset="0x04" size="2"/>
        <register caption="Auxiliary Data" name="AUXDATA" offset="0x06" size="2"/>
      </register-group>
      <register-group caption="Universal Serial Bus" name="USB" size="60">
        <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="USB Enable" mask="0x80" name="ENABLE"/>
          <bitfield caption="Speed Select" mask="0x40" name="SPEED"/>
          <bitfield caption="USB FIFO Enable" mask="0x20" name="FIFOEN"/>
          <bitfield caption="Store Frame Number Enable" mask="0x10" name="STFRNUM"/>
          <bitfield caption="Maximum Endpoint Addresses" mask="0x0F" name="MAXEP"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Pull during Reset" mask="0x10" name="PULLRST"/>
          <bitfield caption="Remote Wake-up" mask="0x04" name="RWAKEUP"/>
          <bitfield caption="Global NACK" mask="0x02" name="GNACK"/>
          <bitfield caption="Attach" mask="0x01" name="ATTACH"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x02" size="1">
          <bitfield caption="Upstream Resume" mask="0x08" name="URESUME"/>
          <bitfield caption="Resume" mask="0x04" name="RESUME"/>
          <bitfield caption="Bus Suspended" mask="0x02" name="SUSPEND"/>
          <bitfield caption="Bus Reset" mask="0x01" name="BUSRST"/>
        </register>
        <register caption="Address Register" name="ADDR" offset="0x03" size="1">
          <bitfield caption="Device Address" mask="0x7F" name="ADDR"/>
        </register>
        <register caption="FIFO Write Pointer Register" name="FIFOWP" offset="0x04" size="1">
          <bitfield caption="FIFO Write Pointer" mask="0x1F" name="FIFOWP"/>
        </register>
        <register caption="FIFO Read Pointer Register" name="FIFORP" offset="0x05" size="1">
          <bitfield caption="FIFO Read Pointer" mask="0x1F" name="FIFORP"/>
        </register>
        <register caption="Endpoint Configuration Table Pointer" name="EPPTR" offset="0x06" size="2"/>
        <register caption="Interrupt Control Register A" name="INTCTRLA" offset="0x08" size="1">
          <bitfield caption="Start Of Frame Interrupt Enable" mask="0x80" name="SOFIE"/>
          <bitfield caption="Bus Event Interrupt Enable" mask="0x40" name="BUSEVIE"/>
          <bitfield caption="Bus Error Interrupt Enable" mask="0x20" name="BUSERRIE"/>
          <bitfield caption="STALL Interrupt Enable" mask="0x10" name="STALLIE"/>
          <bitfield caption="Interrupt Level" mask="0x03" name="INTLVL" values="USB_INTLVL"/>
        </register>
        <register caption="Interrupt Control Register B" name="INTCTRLB" offset="0x09" size="1">
          <bitfield caption="Transaction Complete Interrupt Enable" mask="0x02" name="TRNIE"/>
          <bitfield caption="SETUP Transaction Complete Interrupt Enable" mask="0x01" name="SETUPIE"/>
        </register>
        <register caption="Clear Interrupt Flag Register A" name="INTFLAGSACLR" offset="0x0A" size="1">
          <bitfield caption="Start Of Frame Interrupt Flag" mask="0x80" name="SOFIF"/>
          <bitfield caption="Suspend Interrupt Flag" mask="0x40" name="SUSPENDIF"/>
          <bitfield caption="Resume Interrupt Flag" mask="0x20" name="RESUMEIF"/>
          <bitfield caption="Reset Interrupt Flag" mask="0x10" name="RSTIF"/>
          <bitfield caption="Isochronous CRC Error Interrupt Flag" mask="0x08" name="CRCIF"/>
          <bitfield caption="Underflow Interrupt Flag" mask="0x04" name="UNFIF"/>
          <bitfield caption="Overflow Interrupt Flag" mask="0x02" name="OVFIF"/>
          <bitfield caption="STALL Interrupt Flag" mask="0x01" name="STALLIF"/>
        </register>
        <register caption="Set Interrupt Flag Register A" name="INTFLAGSASET" offset="0x0B" size="1">
          <bitfield caption="Start Of Frame Interrupt Flag" mask="0x80" name="SOFIF"/>
          <bitfield caption="Suspend Interrupt Flag" mask="0x40" name="SUSPENDIF"/>
          <bitfield caption="Resume Interrupt Flag" mask="0x20" name="RESUMEIF"/>
          <bitfield caption="Reset Interrupt Flag" mask="0x10" name="RSTIF"/>
          <bitfield caption="Isochronous CRC Error Interrupt Flag" mask="0x08" name="CRCIF"/>
          <bitfield caption="Underflow Interrupt Flag" mask="0x04" name="UNFIF"/>
          <bitfield caption="Overflow Interrupt Flag" mask="0x02" name="OVFIF"/>
          <bitfield caption="STALL Interrupt Flag" mask="0x01" name="STALLIF"/>
        </register>
